docs/campaigns/F14-cooling-ladder/K0cT_runs/T_hi_c/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.orig";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    hotWall
    {
        type            nutLowReWallFunction;
        value           $internalField;
    }
    coldWall
    {
        type            nutLowReWallFunction;
        value           $internalField;
    }
    topWall
    {
        type            nutLowReWallFunction;
        value           $internalField;
    }
    bottomWall
    {
        type            nutLowReWallFunction;
        value           $internalField;
    }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
