docs/campaigns/F14-cooling-ladder/K0cT_runs/T_hi_c/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.orig";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 6.534829454e+00;

boundaryField
{
    hotWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    coldWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    topWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    bottomWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
